porousVent/benchmark_schmidtModel/schmidtModel_config01/0.org/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 297;

boundaryField
{
    floor
    {
        type            zeroGradient;
    }
    ceiling
    {
        type            zeroGradient;
    }
    fixedWalls
    {
        type            zeroGradient;
    }
    acu8EFB35119AA4591115D9D1BF6014FA4C_fixedWall
    {
        type            zeroGradient;
    }
    acu8EFB35119AA4591115D9D1BF6014FA4C_inlet
    {
        type            zeroGradient;
    }

                acu8EFB35119AA4591115D9D1BF6014FA4C_outlet
        {
            type            fixedValue;
            value            uniform 288.15;
        }
        acu8EFB35119AA4591115D9D1BF6014FA4C_inlet
        {
            type            zeroGradient;
        }
    
    
    acu65E0157C3F4FD3DBFB846500AB325745_fixedWall
    {
        type            zeroGradient;
    }
    acu65E0157C3F4FD3DBFB846500AB325745_inlet
    {
        type            zeroGradient;
    }

                acu65E0157C3F4FD3DBFB846500AB325745_outlet
        {
            type            fixedValue;
            value            uniform 288.15;
        }
        acu65E0157C3F4FD3DBFB846500AB325745_inlet
        {
            type            zeroGradient;
        }
    
    
    oldInternalFaces
    {
        type            empty;
    }
}


// ************************************************************************* //
