porousVent/benchmark_schmidtModel/schmidtModel_config01/0.org/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    floor
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.85;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    ceiling
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.85;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
    fixedWalls
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.85;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }

    acu8EFB35119AA4591115D9D1BF6014FA4C_fixedWall
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.85;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
            acu8EFB35119AA4591115D9D1BF6014FA4C_inlet
        {
            type            calculated;
            value           uniform 0;
        }
        acu8EFB35119AA4591115D9D1BF6014FA4C_outlet
        {
            type            calculated;
            value           uniform 0;
        }
        acu65E0157C3F4FD3DBFB846500AB325745_fixedWall
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.85;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
            acu65E0157C3F4FD3DBFB846500AB325745_inlet
        {
            type            calculated;
            value           uniform 0;
        }
        acu65E0157C3F4FD3DBFB846500AB325745_outlet
        {
            type            calculated;
            value           uniform 0;
        }
        oldInternalFaces
    {
        type            empty;
    }
}


// ************************************************************************* //