porousVent/benchmark_schmidtModel/schmidtModel_config01/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;


vertices
(
    (42.20 23.60 0.30) //0
    (62.20 23.60 0.30) //1
    (62.20 29.80 0.30) //2
    (42.20 29.80 0.30) //3

    (42.20 23.60 0.60) //4
    (62.20 23.60 0.60) //5
    (62.20 29.80 0.60) //6
    (42.20 29.80 0.60) //7

    (42.20 23.60 3.80) //8
    (62.20 23.60 3.80) //9
    (62.20 29.80 3.80) //10
    (42.20 29.80 3.80) //11

);




blocks
(
    hex (0 1 2 3 4 5 6 7) (100 31 3) simpleGrading (1 1 1)
    hex (4 5 6 7 8 9 10 11) (100 31 16) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    floor
    {
        type wall;
        faces
        (
            (0 3 2 1)
            //(4 7 6 5)
        );
    }
    ceiling
    {
        type wall;
        faces
        (
            (8 11 10 9)
        );
    }
    fixedWalls
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (4 5 9 8)
            (1 2 6 5)
            (5 6 10 9)
            (0 3 7 4)
            (4 7 11 8)
            (3 2 6 7)
            (7 6 10 11)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
