porousVent/benchmark_schmidtModel/schmidtModel_config01/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Which of the steps to run
castellatedMesh true;
snap            false;
addLayers       false;


// Geometry. Definition of all surfaces. All surfaces are of class
// searchableSurface.
// Surfaces are used
// - to specify refinement for any mesh cell intersecting it
// - to specify refinement for any mesh cell inside/outside/near
// - to 'snap' the mesh boundary to the surface
geometry
{
    objectsnew.stl
    {
        type	triSurfaceMesh;
        name	objects;
        regions
        {
        
                    acu8EFB35119AA4591115D9D1BF6014FA4C_inlet
            {
                name acu8EFB35119AA4591115D9D1BF6014FA4C_inlet;
            }

            acu8EFB35119AA4591115D9D1BF6014FA4C_outlet
            {
                name acu8EFB35119AA4591115D9D1BF6014FA4C_outlet;
            }

            acu8EFB35119AA4591115D9D1BF6014FA4C_fixedWall
            {
                name acu8EFB35119AA4591115D9D1BF6014FA4C_fixedWall;
            }
                    acu65E0157C3F4FD3DBFB846500AB325745_inlet
            {
                name acu65E0157C3F4FD3DBFB846500AB325745_inlet;
            }

            acu65E0157C3F4FD3DBFB846500AB325745_outlet
            {
                name acu65E0157C3F4FD3DBFB846500AB325745_outlet;
            }

            acu65E0157C3F4FD3DBFB846500AB325745_fixedWall
            {
                name acu65E0157C3F4FD3DBFB846500AB325745_fixedWall;
            }
                }
    }

    interior_walls.stl
    {
        type	triSurfaceMesh;
        name	interior_walls;
        regions
        {
            interior_walls {
                name	fixedWalls;
            }
        }
    }

/*obstacle 
    {
        type searchablePlate;
        original (50.30 27.00 0.5);
        span (0 0.1 0.1);
    }*/

};



// Settings for the castellatedMesh generation.
castellatedMeshControls
{
    maxLocalCells 100000;
    maxGlobalCells 2000000;
    minRefinementCells 10;
    maxLoadUnbalance 0.10;
    nCellsBetweenLevels 3;

    // Explicit feature edge refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies a level for any cell intersected by its edges.
    // This is a featureEdgeMesh, read from constant/triSurface for now.
    features
    (
        {
            file "objectsnew.eMesh";
            level 0;
        }
	{
            file "room_boundary.eMesh";
            level 0;
	}
    );



    // Surface based refinement
    // ~~~~~~~~~~~~~~~~~~~~~~~~

    // Specifies two levels for every surface. The first is the minimum level,
    // every cell intersecting a surface gets refined up to the minimum level.
    // The second level is the maximum level. Cells that 'see' multiple
    // intersections where the intersections make an
    // angle > resolveFeatureAngle get refined up to the maximum level.

    refinementSurfaces
    {
        objects
        {
            level (0 0);
            regions
            {
                                        //Acu 8EFB35119AA4591115D9D1BF6014FA4C
                acu8EFB35119AA4591115D9D1BF6014FA4C_inlet
                {
                    level (0 0);
                    patchInfo
                    {
                                                    type patch;
                                                inGroups (acu8EFB35119AA4591115D9D1BF6014FA4C);
                    }
                }

                acu8EFB35119AA4591115D9D1BF6014FA4C_outlet
                {
                    level (3 3);
                    patchInfo
                    {
                                                    type patch;
                                                inGroups (acu8EFB35119AA4591115D9D1BF6014FA4C);
                    }
                }

                acu8EFB35119AA4591115D9D1BF6014FA4C_fixedWall
                {
                    level (1 1);
                    patchInfo
                    {
                        type wall;
                        inGroups (acu8EFB35119AA4591115D9D1BF6014FA4C);
                    }
                }
                            //Acu 65E0157C3F4FD3DBFB846500AB325745
                acu65E0157C3F4FD3DBFB846500AB325745_inlet
                {
                    level (0 0);
                    patchInfo
                    {
                                                    type patch;
                                                inGroups (acu65E0157C3F4FD3DBFB846500AB325745);
                    }
                }

                acu65E0157C3F4FD3DBFB846500AB325745_outlet
                {
                    level (3 3);
                    patchInfo
                    {
                                                    type patch;
                                                inGroups (acu65E0157C3F4FD3DBFB846500AB325745);
                    }
                }

                acu65E0157C3F4FD3DBFB846500AB325745_fixedWall
                {
                    level (1 1);
                    patchInfo
                    {
                        type wall;
                        inGroups (acu65E0157C3F4FD3DBFB846500AB325745);
                    }
                }
                        }
        }

        interior_walls
        {
            level (0 0);
            regions
            {
                fixedWalls {
                    level (0 0);
                    type wall;
                }
            }
        }


    }

    // Resolve sharp angles
    resolveFeatureAngle 30;


    // Region-wise refinement
    // ~~~~~~~~~~~~~~~~~~~~~~

    // Specifies refinement level for cells in relation to a surface. One of
    // three modes
    // - distance. 'levels' specifies per distance to the surface the
    //   wanted refinement level. The distances need to be specified in
    //   descending order.
    // - inside. 'levels' is only one entry and only the level is used. All
    //   cells inside the surface get refined up to the level. The surface
    //   needs to be closed for this to be possible.
    // - outside. Same but cells outside.

    refinementRegions
    {
    }


    // Mesh selection
    // ~~~~~~~~~~~~~~

    // After refinement patches get added for all refinementSurfaces and
    // all cells intersecting the surfaces get put into these patches. The
    // section reachable from the locationInMesh is kept.
    // NOTE: This point should never be on a face, always inside a cell, even
    // after refinement.
    locationInMesh (42.22 23.62 0.32);


    // Whether any faceZones (as specified in the refinementSurfaces)
    // are only on the boundary of corresponding cellZones or also allow
    // free-standing zone faces. Not used if there are no faceZones.
    allowFreeStandingZoneFaces true;
}



// Settings for the snapping.
snapControls
{
    nSmoothPatch 3;
    tolerance 2.0;
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap false;
    explicitFeatureSnap true;
    multiRegionFeatureSnap false;
}



// Settings for the layer addition.
addLayersControls
{
    relativeSizes true;
    layers
    {
    }
    expansionRatio 1.0;
    finalLayerThickness 0.3;
    minThickness 0.1;
    nGrow 0;
    featureAngle 60;
    slipFeatureAngle 30;
    nRelaxIter 3;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;
    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;
    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}



// Generic mesh quality settings. At any undoable phase these determine
// where to undo.
meshQualityControls
{
    //- Maximum non-orthogonality allowed. Set to 180 to disable.
    maxNonOrtho 65;

    //- Max skewness allowed. Set to <0 to disable.
    maxBoundarySkewness 20;
    maxInternalSkewness 4;

    //- Max concaveness allowed. Is angle (in degrees) below which concavity
    //  is allowed. 0 is straight face, <0 would be convex face.
    //  Set to 180 to disable.
    maxConcave 80;

    //- Minimum pyramid volume. Is absolute volume of cell pyramid.
    //  Set to a sensible fraction of the smallest cell volume expected.
    //  Set to very negative number (e.g. -1E30) to disable.
    minVol 1e-13;

    //- Minimum quality of the tet formed by the face-centre
    //  and variable base point minimum decomposition triangles and
    //  the cell centre. This has to be a positive number for tracking
    //  to work. Set to very negative number (e.g. -1E30) to
    //  disable.
    //     <0 = inside out tet,
    //      0 = flat tet
    //      1 = regular tet
    minTetQuality 1e-30;

    //- Minimum face area. Set to <0 to disable.
    minArea -1;

    //- Minimum face twist. Set to <-1 to disable. dot product of face normal
    //- and face centre triangles normal
    minTwist 0.02;

    //- minimum normalised cell determinant
    //- 1 = hex, <= 0 = folded or flattened illegal cell
    minDeterminant 0.001;

    //- minFaceWeight (0 -> 0.5)
    minFaceWeight 0.02;

    //- minVolRatio (0 -> 1)
    minVolRatio 0.01;

    //must be >0 for Fluent compatibility
    minTriangleTwist -1;


    // Advanced

    //- Number of error distribution iterations
    nSmoothScale 4;
    //- amount to scale back displacement at error points
    errorReduction 0.75;
}


// Advanced

// Flags for optional output
// 0 : only write final meshes
// 1 : write intermediate meshes
// 2 : write volScalarField with cellLevel for postprocessing
// 4 : write current intersections as .obj files
debug 0;


// Merge tolerance. Is fraction of overall bounding box of initial mesh.
// Note: the write tolerance needs to be higher than this.
mergeTolerance 1e-6;


// ************************************************************************* //
